In [9]:
import pandas as pd
from string import ascii_lowercase

In [6]:
sr = pd.Series([1,2,3], dtype="int64[pyarrow]", index=['a','b','c'])

sr

a    1
b    2
c    3
dtype: int64[pyarrow]

In [24]:
# Create list and make into series, change series indexes to letters,
# and print element of list based on user input letter
 
from string import ascii_lowercase

letters = ascii_lowercase
lis = []
ind = []

lis_len = int(input('How many items (1-26?): '))
for i in range(lis_len):
    item = input('Enter a number: ')
    lis.append(item)
    item_ind = letters[i]
    ind.append(item_ind)

ser = pd.Series(lis, dtype="int64[pyarrow]", index=ind)

letter = input('Enter a letter: ')

print(ser[letter])

14

In [32]:
# Create series that is at least 3 numbers long; find mean and median
# Print which is larger

ser_1 = pd.Series([1, 2, 3, 4, 5], dtype="int64[pyarrow]")

m1 = ser_1.mean()
m2 = ser_1.median()

print(f'Mean: {m1}\nMedian: {m2}')

if m1 > m2:
    print('The mean is larger.')
elif m2 > m1:
    print('The median is larger.')
else:
    print('The mean and median are equal.')

Mean: 3.0
Median: 3.0
The mean and median are equal.

In [36]:
# Create a DataFrame from a dictionary (class example)
data = {'Name': ['John', 'Jane', 'Jim', 'Joan'],
        'Age': [30, 29, 31, 32],
        'City': ['New York', 'London', 'Paris', 'Berlin']}
df = pd.DataFrame(data)

# Display the DataFrame
print(df) # Normal print
df # Pretty formatting (Jupyter)

   Name  Age      City
0  John   30  New York
1  Jane   29    London
2   Jim   31     Paris
3  Joan   32    Berlin

   Name  Age      City
0  John   30  New York
1  Jane   29    London
2   Jim   31     Paris
3  Joan   32    Berlin

In [65]:
# Create a DataFrame from a dictionary for student info
student_data = {'First Name': ['John', 'Jane', 'Jim', 'Joan', 'James'],
        'Last Name': ['Smith', 'Brown', 'Silver', 'Carr', 'Fazio'],
        'Age' : [18, 21, 28, 19, 26],
        'State': ['NY', 'NY', 'VT', 'PA', 'MA'],
        'Phone Number': ['(123)123-1234', '(234)234-2345',
                         '(345)345-3456', '(456)456-4567', '(567)567-5678']}

student_df = pd.DataFrame(student_data)

# Cast columns to pyarrow data types (necessary?)
student_df = student_df.astype({'First Name': 'string[pyarrow]',
                                'Last Name': 'string[pyarrow]',
                                'Age': 'int64[pyarrow]',
                                'State': 'string[pyarrow]',
                                'Phone Number': 'string[pyarrow]'})

# Another way to reassign data types (cast entire column to new dtype)
# student_df['Age'] = student_df['Age'].astype('string[pyarrow]')

# Display the dtypes and DataFrame
print(student_df.dtypes)
student_df

First Name      string[pyarrow]
Last Name       string[pyarrow]
Age              int64[pyarrow]
State           string[pyarrow]
Phone Number    string[pyarrow]
dtype: object

  First Name Last Name  Age State   Phone Number
0       John     Smith   18    NY  (123)123-1234
1       Jane     Brown   21    NY  (234)234-2345
2        Jim    Silver   28    VT  (345)345-3456
3       Joan      Carr   19    PA  (456)456-4567
4      James     Fazio   26    MA  (567)567-5678